content/post/a-vision-of-a-multi-threaded-emacs.md
+++
title = "A vision of a multi-threaded Emacs"
author = ["Troy Hinckley"]
date = 2022-05-19
tags = ["emacs"]
draft = false
+++

## The Threading library {#the-threading-library}

Starting in Emacs 26 some very ambitious changes were added. Basic thread support was enabled, laying the groundwork for a future concurrent emacs. The [docs](https://www.gnu.org/software/emacs/manual/html_node/elisp/Threads.html) layout this possibility:

> Emacs Lisp provides a limited form of concurrency, called threads. All the threads in a given instance of Emacs share the same memory. Concurrency in Emacs Lisp is “mostly cooperative”, meaning that Emacs will only switch execution between threads at well-defined times. However, the Emacs thread support has been designed in a way to later allow more fine-grained concurrency

What would a future with fine-grained concurrency look like? Could we have an Emacs that uses more then 1 thread? This post sketches out some rough ideas of what that could look like from an elisp perspective. I am going to take the easy way out and completely ignore  _how_ to actually implement this, just speculating on the big what-ifs.


## Concurrency vs parallelism {#concurrency-vs-parallelism}

The `thread` feature is specifically trying to enable _concurrency_, which is the ability to interweave lines of execution to make progress on more then one program at a time. This is the model used by async/await and coroutines. Concurrency is useful when your application is IO bound. The library enables you to switch between concurrent programs at designated points, which is why it is call _cooperative_ concurrency. _Parallelism_ on the other hand is the ability to actually run multiple programs at the same time. This is useful when your application is CPU bound. See [this post](https://oxylabs.io/blog/concurrency-vs-parallelism) for a more detailed explanation.

There are two main scenarios where concurrency/parallelism are useful.

1.  When I want some elisp task done in the background without blocking my main user thread, I can use concurrency. This includes things like handling filter output, indexing buffers, watching for changes, etc. The background task will "steal" idle time from my main thread to make incremental progress on its job.
2.  When I want to get the results of some task faster, I need parallelism. This includes things like updating or searching buffers, applying font lock, or loading code. In order to do these task faster I need multiple threads running at the same time.

Note that parallelism can service both use case 1 and 2, but concurrency can only deal with use case 1. In some sense, parallelism is a superset of concurrency. All parallel code is concurrent, but concurrent code is not necessarily parallel. For this reason, I am much more interested in a parallel Emacs then just a concurrent one.


## What level of parallelism do you want? {#what-level-of-parallelism-do-you-want}

My oversimplification of parallel languages breaks them into three categories:

Level 1 - memory unsafe and data races allowed
: Languages where incorrect code can lead to corruption of the program state and segfaults. This includes C++ and Swift.

Level 2 - memory safe and data races allowed
: Languages where parallelism is memory safe, but can still lead to data races. This includes Java and Go.

Level 3 - memory safe and no data races
: Languages that enable [fearless concurrency](https://doc.rust-lang.org/book/ch16-00-concurrency.html) by eliminating unguarded access to shared-memory. This includes Clojure, Rust, and TCL.

Generally the closer you are Level 1 the more footguns there are, but the more performance you can squeeze out. The higher you go the easier concurrent code is to write, but you have less performance and control. The exception to this is Rust, which is a safe Level 3 language with the performance of a Level 1.

So where do we want Emacs to land on this spectrum? The creator of [nogil](https://github.com/colesbury/nogil) python, a multi-threaded python implementation, [said this](https://docs.google.com/document/d/18CXhDb1ygxg-YXNBJNzfzZsDFosB5e6BfnXLlejd9l0/edit):

> The project aims for a concurrency model that matches the threads + shared memory model implemented in common operating systems... The shared-memory model is notoriously difficult to program correctly, but provides a good base to build better abstractions because it closely matches the primitives provided by the operating system (e.g. threads, mutexes).

The argument is that Level 2 is the right balance, because you avoid crazy bugs you get with unsafe languages but still have more flexibility then level 3. You should just give programmers the tools they need to build safe abstractions.

I, however, disagree with that take. As the author said, shared memory is "notoriously difficult" to do correctly. As Emacs pulls in hundreds of packages, the potential for data races grows exponentially. Even Emacs' current threads library [suffers from data races](https://nullprogram.com/blog/2018/05/31/) which is one of the reasons I believe it has not seen much adoption. We need to make concurrency as pain free as possible if it is going to be usable. Therefore I am in the "Emacs parallelism should be level 3" boat.


### What are some requirements for parallel Emacs {#what-are-some-requirements-for-parallel-emacs}

So what are the standards we want for a multi-threaded Emacs implementation? Here is my short list:

1.  No [function coloring](https://journal.stuffwithstuff.com/2015/02/01/what-color-is-your-function/) or special requirements on functions. One of Emacs' big advantages is the huge bulk of existing lisp code. We want to reuse as much as we can. This is generally only a problem with concurrent schemes like async/wait.
2.  No data races. This will make programs significantly easier to write correctly, but is also going to make our code more limited (\*\* _foreshadowing \*\*_).
3.  We want the behavior of multi-threaded code to be as close to single-threaded code as possible. More on this later.


## A jumping off point {#a-jumping-off-point}

Most people have never heard of TCL (or if they have they've never used it) but I find it has a [very simple approach](https://www.activestate.com/blog/threads-done-right-tcl/) to multi-threading. Essentially the interpreter can work in its own thread, and carries with it all of its state. This is the multi-interpreter approach; Every thread starts in a clean environment with its own interpreter. "Messages" can be passed to any thread and they can return a result. In elisp it could look something like this.

```emacs-lisp
(let ((thread1 (make-thread))
      (thread2 (make-thread))
      (filename "file.txt")
      result1 result2)
  ;; Send commands to the threads
  (thread-send thread1 #'setup-function)
  (setq result1 (thread-send thread1 #'my-function))
  ;; closure captures a copy of the variable
  (setq result2 (thread-send thread2 (lambda () (delete-file filename))))
  ;; run some other code while threads are working
  (my-other-function)
  ;; wait for the results to populate
  (thread-wait result1 result2)
  ;; return the results in list
  (list result1 result2))
```

This is really simple and really effective, but it has some limitations. First is that since each thread starts a new interpreter, you need to load a bunch of lisp code to do almost anything useful. This means that thread overhead is significant and is not a good fit for small tasks. Second, since you are copying objects between threads when you pass them with `thread-send` you can't modifying existing buffers[^fn:1]. And buffers are probably the most important use case here. Let's see if we can fix that.
