blog.org
*** Can you pass the buffer please?
What if instead of needing to copy the buffers between threads, they could be shared? I know, I know, shared-memory is a footgun, but we are going to use mutex's! So it more like sharing in pre-school where everyone get's a turn. Each buffer is guarded by a mutex, and only one thread can have access to a buffer at a given time. The way you acquire the mutex is by switching to that buffer (using ~set-buffer~ , ~switch-to-buffer~, or ~with-current-buffer~). Just as you can only have a single "current buffer", you can only have the mutex for a single buffer at a time. A thread can switch to a buffer, do some operations, then release it. This is all well and good, but we have a major issue; shared-state.

You see, for a buffer to really be useful you need have the buffer local variables. Without those you can't even know the ~major-mode~! But buffer local variable can share data with global variables, and each thread has its own set of globals. Consider the code below:
#+begin_src emacs-lisp
  (defvar local nil)
  (defvar global nil)
  (make-variable-buffer-local 'local)
  (setq local '(1 2 3))
  (setq global local)
#+end_src

Here both ~local~ and ~global~ share the same cons cells. If I mutate one it will mutate the other. This obviously won't work if I am sharing buffer local variables between threads. What we need to sever the ties between these. Buffer local variables can't share any data with non-buffer local variables. You could setup a write barrier that would make copies when a thread releases the mutex. But I am not going to get into the /how/ (I get to ignore implementation details remember?).

This would technically make multi-threaded emacs have different behavior then the old single threaded one (I told you we would talk about that later). But I would argue that if you are relying on sharing data between globals and buffer-locals for the correct operation of your code, it is in serious need of a refactor. I imagine that in real life this situation is very rare.

*** Cutting down initialization
As it currently stands you basically need to load your entire init file in each new thread. Why can't you just load the bare minimum elisp? Consider what would happen when a buffer local hook calls some function from another package? We need to make sure the code is loaded, and the only way we can do that is by loading the init file which contains all package initialization. There is also the problem that the state can get out sync. Each thread would start in a clean state, but this is not going to match the state of your main thread. This impedance mismatch is a clear source of bugs.

What if we did something crazy? What if we said that all functions are shared between threads? If you think about it, this is almost a perfect match. Function rarely change, and when they do, you can just replace the whole function atomically. However to do this you would need to address the /functional literal mutation problem/ I talk about [[https://coredumped.dev/2021/04/07/when-pure-function-lie/][here]]. Otherwise you could have multiple threads mutating the same function constants and potentially corrupt the VM state. But again, /implementation details/.

Okay so that takes care of functions, but what about variables? Sharing variables would lead to data races, which is exactly what we are trying avoid. What if instead of sharing, we copied variables on demand? Hear me out! The first time a "sub-thread" does a lookup of a global variable, its value is copied from the main thread. This sets the initial value in that thread. From then on that copy of the value is "owned" by the thread and it can be mutated or read whenever. This would also help with the out-of-sync with the main thread problem we mentioned earlier. The state in your sub-thread would be much closer to the main global state. There could be an message queue internal to the VM that sends these requests back and forth. At certain points, the main thread would check the queue and send the values.

But this also means that sub-threads could spend a decent amount of time waiting for the main thread to be ready to send the values it needs, at least at the start. There could be a couple ways to alleviate this. The one that comes to mind is you could cache the list of variables used at the call site of the thread creation. Then next time the thread is called you eagerly copy all the variables it has used before. This would make repeated initialization of the same thread much faster, but could also mean you get different variables the first time vs following times (if the calling function changed something immediately afterwards for example). As with everything; trade-offs.

There is one big reason for all this song and dance around buffers locals, functions, and variables: reusing existing elisp code. Languages that were created with concurrency in mind have designed their languages around these considerations. But Emacs is a giant ball of mutable state. Taming that to do something useful in a multi-threaded world while still reusing existing code is tricky.
*** Going Green
So our threads are pretty cheap to create (as threads go), but not to keep around. Each elisp thread maps to a OS thread, and even when thread is idle it is still taking OS resources. Go and Clojure have solved this by creating so called green threads that are managed by the runtime. The green threads will be executed on OS threads, but they can be created, destroyed and managed by the VM. In Go you can create thousands of green threads and it will not impact the system. Don't try at home with OS threads.

Now that we have green threads, the observant among you will notice that we have basically reinvented goroutines. All we need to do is add channels and we can have something close to [[https://clojuredocs.org/clojure.core.async][core.async]]. I imagine usage looking something like this:

#+begin_src emacs-lisp
  ;; Delete 3 files concurrently
  (let ((files '("file1.txt" "file2.txt" "file3.txt")))
    (dolist (file files)
      (go (delete-file file))))

  ;; loop through all buffers and insert "a" for some reason...
  (let* ((c (chan)))
    (go (loop-chan chan buffer
                   (with-current-buffer buffer
                     (insert "a"))))
    (dolist (buffer (buffer-list))
      (chan-put c buffer)))

  ;; run a buffer search on another thread and yield the output
  (let ((queries (chan))
        (results (chan)))
    (go (let* ((message (channel-take queries))
               (buffer (car message))
               (string (cdr message)))
          (chan-put results
                    (with-current-buffer buffer
                      (save-excursion
                        (re-search-forward string)
                        (buffer-substring
                         (point)
                         (+ 5 (point))))))))
    (chan-put queries (cons other-buffer "foo"))
    (do-something-else)
    ;; wait till the routine returns
    (setq my-string (chan-take results)))
#+end_src

