content/post/a-vision-of-a-multi-threaded-emacs.md


## So where does that leave us? {#so-where-does-that-leave-us}

We have created some simple light weight green threads for Emacs. Well, we didn't actually create anything, but we sure did talk about it a lot! The thing I like about this approach is that threads are easy to create and use to accomplish work in parallel. There are no data races and footguns have been minimized. But I can still see a few open problems that are not solved:

1.  The most important buffer in Emacs is the one you are currently editing. But with the mutex scheme, you can't use any other threads to work on that buffer! If you want to index or search or syntax-highlight the buffer, that still needs to use your main thread, meaning that the user is blocked. I don't like it, but am not sure of a clean way to fix it.
2.  What about when you need to iterate over all buffers (like with `ibuffer`)? Here you would need to acquire the mutex for each one in turn. If another thread is using a buffer the main thread will have to wait. Hopefully sub-threads would choose to do their work incrementally, giving time for the thread to yield the mutex.
3.  Since the sub-threads take their global variables from the main thread, you can't load code in parallel. Only the main thread can load code that can be used by everyone.
4.  I haven't even mentioned a bunch of other multi-threading concerns like cancellation, atomics, garbage collection, message queue buffering, semaphores, signals, error reporting, debugging, concurrent data structures, C integration, deadlock, and livelock to name a few. Perhaps those are a topic for a future post.

It has been fun to speculate about multi-threaded Emacs. But the real question is, would it be worth it? Emacs has gotten along just fine with a single thread; In fact many (most?) dynamic languages have. I would guess that threads would only be useful in about 10% of the programming tasks you would do in elisp. But when threads can be used, they would be big boon.

As with everything in engineering, concurrency comes with trade-offs. Implementing a scheme like I described would be a monumental task. It would probably involve a complete rewrite of the core runtime[^fn:2]. Also anytime you make an interpreter multi-threaded, you make single threaded code slower[^fn:3]. There is no avoiding that. If 90% of code is still single-threaded, is that worth the cost?

Anyways, I would love to get some feedback on the ideas presented. Are there obvious holes that I missed? Would this scheme be useful? Do you know way that these could be implemented (or would not be possible to implement)? How does this compare to other dynamic languages? Do you prefer the more "thread-like" or "green-thread-like" approach? Is there a way to address some of the problems presented above?


### Have a comment? {#have-a-comment}

Join the discussion on [HN](https://hn.algolia.com/?dateRange=all&page=0&prefix=false&query=https%3A%2F%2Fcoredumped.dev%2F2022%2F05%2F19%2Fa-vision-of-a-multi-threaded-emacs%2F&sort=byPopularity&type=story), [Lobsters](https://lobste.rs/search?q=https%3A%2F%2Fcoredumped.dev%2F2022%2F05%2F19%2Fa-vision-of-a-multi-threaded-emacs%2F&what=stories&order=newest), [Reddit](https://www.reddit.com/search/?q=url%3Acoredumped.dev%2F2022%2F05%2F19%2Fa-vision-of-a-multi-threaded-emacs%2F&sort=top), or send me an [email](mailto:troy.hinckley@dabrev.com)

[^fn:1]: And you can't share anything that doesn't have a clear [readable](https://www.gnu.org/software/emacs/manual/html_node/elisp/Streams-Intro.html) representation such as windows, frames, or makers.
[^fn:2]: Similar to what is being attempted for python [here](https://github.com/colesbury/nogil) and [here](https://github.com/larryhastings/gilectoy).
[^fn:3]: Why does adding multi-threading make single-threaded code slower? It essentially comes down the fact that synchronizing memory between cores is [slow](https://spcl.inf.ethz.ch/Publications/.pdf/atomic-bench.pdf). So unless your interpreters are completely independent (which would not be very useful), you are going to add some overhead. Now this doesn't have to be a lot, it can be just a couple percentage points. But it will always be something. The [nogil design doc](https://docs.google.com/document/d/18CXhDb1ygxg-YXNBJNzfzZsDFosB5e6BfnXLlejd9l0/edit) goes into great detail about some of performance implications (for python) and how to mitigate them. See also this [design doc](https://github.com/ocamllabs/compiler-hacking/wiki/OCaml-Multicore-Runtime) for multi-core OCaml or [this presentation](https://www.atdot.net/~ko1/activities/2016_rubykaigi.pdf) on the Actor model in Ruby.
